app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = 8
---
  def index
    if params[:author_id]
      @posts = Post.all
      Author.find(params[:author_id]).posts